low_velocity/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00015;

boundaryField
{
    INLET
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    JET_WALL
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    DOWN
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    UP
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    OUTWALL
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
}


// ************************************************************************* //
