low_velocity/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    INLET
    {
        type            zeroGradient;;
    }
    JET_WALL
    {
        type            nutkRoughWallFunction;
        Ks              uniform 0.0001;
        Cs              uniform 0.5;
        value           uniform 5e-07;
    }
    DOWN
    {
        type            zeroGradient;
    }
    UP
    {
        type            nutkRoughWallFunction;
        Ks              uniform 0.0001;
        Cs              uniform 0.5;
        value           uniform 5e-07;
    }
    OUTWALL
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
