low_velocity/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    INLET
    {
        type            totalPressure;
        p0              uniform 0;
    }
    JET_WALL
    {
        type            fixedFluxPressure;
	phi             phiAbs;
        value           uniform 0;
    }
    DOWN
    {
        type            totalPressure;
        p0              uniform 0;
    }
    UP
    {
        type            fixedFluxPressure;
	phi             phiAbs;
        value           uniform 0;
    }
    OUTWALL
    {
        type            totalPressure;
        p0              uniform 0;
    }
}

// ************************************************************************* //
