low_velocity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   0.001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.8;

maxAlphaCo      0.8;

maxDeltaT       1;

/*functions
{
    surfaceInterpolate1
    {
	    // Mandatory entries
	    type            surfaceInterpolate;
	    libs            (fieldFunctionObjects);
	    fields          ((alpha.water surfaceAlpha));

	    // Optional (inherited) entries
	    region          region0;
	    enabled         true;
	    log             true;
	    timeStart       0;
	    timeEnd         1;
	    executeControl  writeTime;
	    //executeInterval -1;
	    writeControl    writeTime;
	    //writeInterval   -1;
    }   
    sumvalue
    {
	// Mandatory entries
	    type            volFieldValue;
	    libs            (fieldFunctionObjects);
	    fields          (surfaceAlpha);

	    // Optional (inherited) entries
	    region          UP;
            operation       sum;
	    enabled         true;
	    log             true;
	    timeStart       0;
	    timeEnd         1;
	    executeControl  writeTime;
	    //executeInterval -1;
	    writeControl    writeTime;
	    //writeInterval   -1;
    }
}*/

// ************************************************************************* //
